In [2]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10,'b': 20, 'c':30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
ser1 =pd.Series([1,2,3,4],["USA","Germany","USSR", "Jappan"])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Jappan     4
dtype: int64

In [13]:
ser2 =pd.Series([1,2,5,4],["USA","Germany","Italy", "Jappan"])

In [14]:
ser2

USA        1
Germany    2
Italy      5
Jappan     4
dtype: int64

In [15]:
ser1['Germany']

2

In [16]:
ser1 + ser2

Germany    4.0
Italy      NaN
Jappan     8.0
USA        2.0
USSR       NaN
dtype: float64

In [19]:
from numpy.random import randn

In [20]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [21]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [23]:
df["W"]

A   -0.089066
B    0.508186
C   -0.855879
D   -1.371523
E    0.633608
Name: W, dtype: float64

In [24]:
type(df["W"])

pandas.core.series.Series

In [25]:
df.W

A   -0.089066
B    0.508186
C   -0.855879
D   -1.371523
E    0.633608
Name: W, dtype: float64

In [26]:
df[["W","W"]]

          W         W
A -0.089066 -0.089066
B  0.508186  0.508186
C -0.855879 -0.855879
D -1.371523 -1.371523
E  0.633608  0.633608

In [27]:
df["N"] = df["W"]**2

In [28]:
df

          W         X         Y         Z         N
A -0.089066 -1.588694 -0.156870  0.079006  0.007933
B  0.508186 -0.560546 -0.859234 -0.360624  0.258253
C -0.855879 -0.531533  0.753451  1.698146  0.732529
D -1.371523 -1.294812  0.518493 -2.105346  1.881076
E  0.633608 -0.411804  0.254627 -0.377077  0.401459

In [31]:
df.drop("N", axis=1, inplace=True)

In [32]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [33]:
df.drop("E")

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346

In [34]:
df.shape

(5, 4)

In [35]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [40]:
df[["X","Z"]]

          X         Z
A -1.588694  0.079006
B -0.560546 -0.360624
C -0.531533  1.698146
D -1.294812 -2.105346
E -0.411804 -0.377077

In [41]:
df.loc['B']

W    0.508186
X   -0.560546
Y   -0.859234
Z   -0.360624
Name: B, dtype: float64

In [42]:
df.iloc[1]

W    0.508186
X   -0.560546
Y   -0.859234
Z   -0.360624
Name: B, dtype: float64

In [43]:
df.loc['A',"Z"]

0.07900589907243041

In [44]:
df > 0

       W      X      Y      Z
A  False  False  False   True
B   True  False  False  False
C  False  False   True   True
D  False  False   True  False
E   True  False   True  False

In [45]:
booldf = df > 0

In [46]:
df[booldf]

          W   X         Y         Z
A       NaN NaN       NaN  0.079006
B  0.508186 NaN       NaN       NaN
C       NaN NaN  0.753451  1.698146
D       NaN NaN  0.518493       NaN
E  0.633608 NaN  0.254627       NaN

In [47]:
df[df>0]

          W   X         Y         Z
A       NaN NaN       NaN  0.079006
B  0.508186 NaN       NaN       NaN
C       NaN NaN  0.753451  1.698146
D       NaN NaN  0.518493       NaN
E  0.633608 NaN  0.254627       NaN

In [48]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [49]:
df["W"]>0

A    False
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [50]:
df[df["W"]>0]

          W         X         Y         Z
B  0.508186 -0.560546 -0.859234 -0.360624
E  0.633608 -0.411804  0.254627 -0.377077

In [51]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [55]:
df[df["Z"]<0]["W"]

B    0.508186
D   -1.371523
E    0.633608
Name: W, dtype: float64

In [58]:
df[(df['W']>0) | (df['Z']<0)]

          W         X         Y         Z
B  0.508186 -0.560546 -0.859234 -0.360624
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [59]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [60]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.089066 -1.588694 -0.156870  0.079006
1     B  0.508186 -0.560546 -0.859234 -0.360624
2     C -0.855879 -0.531533  0.753451  1.698146
3     D -1.371523 -1.294812  0.518493 -2.105346
4     E  0.633608 -0.411804  0.254627 -0.377077

In [61]:
df

          W         X         Y         Z
A -0.089066 -1.588694 -0.156870  0.079006
B  0.508186 -0.560546 -0.859234 -0.360624
C -0.855879 -0.531533  0.753451  1.698146
D -1.371523 -1.294812  0.518493 -2.105346
E  0.633608 -0.411804  0.254627 -0.377077

In [62]:
newind = 'CA NY WR OR CO'.split()

In [63]:
df["States"] = newind

In [64]:
df

          W         X         Y         Z States
A -0.089066 -1.588694 -0.156870  0.079006     CA
B  0.508186 -0.560546 -0.859234 -0.360624     NY
C -0.855879 -0.531533  0.753451  1.698146     WR
D -1.371523 -1.294812  0.518493 -2.105346     OR
E  0.633608 -0.411804  0.254627 -0.377077     CO

In [65]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.089066 -1.588694 -0.156870  0.079006
NY      0.508186 -0.560546 -0.859234 -0.360624
WR     -0.855879 -0.531533  0.753451  1.698146
OR     -1.371523 -1.294812  0.518493 -2.105346
CO      0.633608 -0.411804  0.254627 -0.377077